# Задача:
# Да се състави програма, която въвежда цяло трицифрено число
# и извежда на екрана сумата и произведението на цифрите му.

# Обяснение:
# За да намерим сумата и произведението на цифрите,
# трябва да отделим трите цифри на числото.

# Цифрата на стотиците се получава чрез цяло деление на 100.
# Например, за числото 123: 123 // 100 = 1

# Цифрата на единиците се получава като остатък при деление на 10.
# Например: 123 % 10 = 3

# Цифрата на десетиците се намира така:
# Първо: 123 // 10 = 12 (махаме последната цифра)
# После: 12 % 10 = 2 (вземаме последната цифра от резултата)
# Търсената цифра е 2.

# ---------------------------
# Програма:

# Въвеждане на трицифреното число
n = int(input("Въведете трицифрено число: "))

# Извличане на цифрите
c = n // 100           # стотици
d = (n // 10) % 10     # десетици
e = n % 10             # единици

# Изчисления
suma = c + d + e
proizvedenie = c * d * e

# Извеждане на резултатите
print("Сумата на цифрите е:", suma)
print("Произведението на цифрите е:", proizvedenie)
