# Въвеждане на страните a, b и c
a = float(input("Въведете страна a: "))
b = float(input("Въведете страна b: "))
c = float(input("Въведете страна c: "))

# Изчисляване на разликата между основите
d = (a - b) / 2

# Проверка дали може да съществува такъв равнобедрен трапец
if d < c:
    h = (c * c - d * d) ** 0.5   # височината (без math.sqrt)
    S = ((a + b) / 2) * h        # лицето
    print("S =", S)
else:
    print("Некоректни данни")
# примерен вход: 12 4 3
# примерен изход: некоректни данни
# нов проблем:
# примерен вход: 4 16 2
